[
  {
    "title":"Registration",
    "speaker":"",
    "description":"",
    "start": 1423227600,
    "end": 1423231200,
    "track": "Generic"
  },
  {
    "title":"Opening Remarks & Keynote",
    "speaker":"",
    "description":"",
    "start": 1423231200,
    "end": 1423233900,
    "track": "Generic"
  },
  {
    "title":"Lunch",
    "speaker":"",
    "description":"",
    "start": 1423244700,
    "end": 1423248300,
    "track": "Generic"
  },
  {
    "title":"Party",
    "speaker":"",
    "description":"",
    "start": 1423265400,
    "end": 1423276200,
    "track": "Generic"
  },
  {
    "title":"Lunch",
    "speaker":"",
    "description":"",
    "start": 1423327500,
    "end": 1423331100,
    "track": "Generic"
  },
  {
    "title":"Closing Remarks",
    "speaker":"",
    "description":"",
    "start": 1423345500,
    "end": 1423347300,
    "track": "Generic"
  },



  {
    "title":"101: iOS Apprentice Review 1",
    "speaker":"Tammy Coron",
    "description":"You read the book. Now it’s time to put your knowledge to the test. Wait, you did read the book, right? :] In this session, you’ll review the basic concepts of the programming language Swift. You’ll learn about objects, protocols, methods, and more. You’ll have an opportunity to work with UIKit, Auto Layout, and Size Classes as you build a super secret wicked cool app.",
    "start": 1423234800,
    "end": 1423239300,
    "track": "Beginner"
  },
  {
    "title":"102: iOS Apprentice Review 2",
    "speaker":"Brian Moakley",
    "description":"Prerequisite: 101: iOS Apprentice Review 1\n\nThis exciting sequel to the first tutorial features the adventures of an iOS Apprentice who attempts to navigate the dark corridors of Xcode in a quest to make the app of dreams. Thrill as Swift harnesses the power of view controllers, segues, and storyboards that ultimately turns this iOS Apprentice into a full born wizard.",
    "start": 1423240200,
    "end": 1423244700,
    "track": "Beginner"
  },
  {
    "title":"103: Auto Layout",
    "speaker":"Greg Heo",
    "description":"If you’re tired of manually resizing labels to fit the strings your German translator provided, this session is for you! We’ll look at building interfaces with Auto Layout in interface builder, layout margins, and how to work with auto layout constraints in code. These tools will help you design apps to work across different screen sizes, and get you ready for our following talks on Adaptive Layout and Animating Auto Layout Constraints.",
    "start": 1423248300,
    "end": 1423252800,
    "track": "Beginner"
  },
  {
    "title":"104: Adaptive Layout",
    "speaker":"Sam Davies",
    "description":"iOS 8 supports five different screen sizes, and as a developer you should support all of these. You have a choice: either create five distinct layouts, or get with the cool kids and learn to love Auto Layout and Adaptive Layout. This tutorial will get you up to speed to Adaptive Layout in IB, and cover some of the underlying concepts including size classes and trait collections.",
    "start": 1423253700,
    "end": 1423258200,
    "track": "Beginner"
  },
  {
    "title":"105: App Extensions",
    "speaker":"Chris Wagner",
    "description":"Do you have a great app that you want your users to get access to quicker? Come learn how to make your Today Extensions! These allow your users to access succinct elements of your app right from the lock screen and notification center. You will leave this session with a working widget and the information required to extend your own apps.",
    "start": 1423317600,
    "end": 1423322100,
    "track": "Beginner"
  },
  {
    "title":"106: WatchKit 1",
    "speaker":"Greg Heo",
    "description":"Prerequisite: 105: App Extensions\n\nAre you ready to buck the trend of larger screen sizes? Get started with developing for Apple Watch and bring the “personal” back to “personal computing” in this session! You’ll learn all about the big picture architecture that links your app, iPhone, and Watch together as well as how to lay out your interface and handle user interaction.",
    "start": 1423323000,
    "end": 1423327500,
    "track": "Beginner"
  },
  {
    "title":"107: WatchKit 2",
    "speaker":"Mic Pringle",
    "description":"Prerequisite: 106: WatchKit 1\n\nIf session #1 whets your appetite for WatchKit, you’ll love the three course meal that is WatchKit session #2. You’ll start with an entrée of tables, menus and navigation controllers, before being served up a main of Glances, and finally finishing off with a fruity Notification flavoured desert. Expect to walk away feeling full and satisfied.",
    "start": 1423331100,
    "end": 1423335600,
    "track": "Beginner"
  },
  {
    "title":"108: Parse",
    "speaker":"Fosco Marotto",
    "description":"Setting up your own servers and databases is a thing of the past! Come find out how to use Parse so you can focus on your app idea, not your infrastructure. We’ll build an app together and discuss how to get the most value out of the Parse platform.",
    "start": 1423336500,
    "end": 1423341000,
    "track": "Beginner"
  },



  {
    "title":"201: Swift for Objective-C Devs: Language Basics",
    "speaker":"Matt Galloway",
    "description":"Swift is the new shiny from Apple. It’s the future of iOS programming for sure. You’ve probably heard about it, maybe even dabbled in it. This tutorial is your opportunity to dive right in and learn about the basics Swift. After this you’ll be ready and fired up for the following tutorials which take you further.",
    "start": 1423234800,
    "end": 1423239300,
    "track": "Intermediate"
  },
  {
    "title":"202: Swift for Objective-C Devs: Generics, Closures, Enums and Switch Statements",
    "speaker":"Matthijs Hollemans",
    "description":"Prerequisite: 201: Swift for Obj-C Devs: Language Basics\n\nHave you mastered the basics of Swift, but still a little unclear about the more advanced features? Learn to unlock the full expressiveness of Swift with generics, closures, and enums. Generics allow you avoid duplicated code, closures allow a functional programming style, and enums are often a better solution than classes or structs.",
    "start": 1423240200,
    "end": 1423244700,
    "track": "Intermediate"
  },
  {
    "title":"203: Swift for Objective-C Devs: Swift & Cocoa",
    "speaker":"Matt Galloway",
    "description":"Prerequisite: 202: Swift for Objective-C Devs: Generics, Closures, Enums and Switch Statements.\n\nDeveloping iOS apps is about much more than the language. Whether you’re writing in Swift or Objective-C, you need to know how the system frameworks, Cocoa, are interfaced with. In this tutorial you’ll learn how interfacing with Cocoa works in Swift: from the design patterns, to bridging between Swift and Objective-C, and more!",
    "start": 1423248300,
    "end": 1423252800,
    "track": "Intermediate"
  },
  {
    "title":"204: Swift for Objective-C Devs: Functional Programming",
    "speaker":"Alexis Gallagher",
    "description":"Prerequisite: 203: Swift for Obj-C Devs: Swift and Cocoa\n\nSwift introduces a load of new language features, but what’s the best way to make the most of them? This tutorial provides a pragmatic introduction to functional programming in Swift, comparing an object-oriented approach to a more functional approach. No prior experience required.",
    "start": 1423253700,
    "end": 1423258200,
    "track": "Intermediate"
  },
  {
    "title":"205: Beginning Core Graphics",
    "speaker":"Jake Gundersen",
    "description":"Core Graphics is the API for drawing in iOS. Forget importing vector PDFs; use the battle tested 2D drawing API to draw custom vector shapes. No more PNG bloat, your entire UI can be drawn using code! In this tutorial, you’ll learn the basics of the Core Graphics API and how to use modern tools like PaintCode to assist your journey.",
    "start": 1423317600,
    "end": 1423322100,
    "track": "Intermediate"
  },
  {
    "title":"206: Dynamic Custom Controls in Xcode 6",
    "speaker":"Ricardo Rendon Cepeda",
    "description":"Prerequisite: 205: Beginning Core Graphics\n\nNew in Xcode 6, it’s Live Rendering! In this session, you’ll learn how to unleash your UI code and preview custom drawn controls, all without running on your device or simulator. You won’t believe your eyes as fonts, shapes, attributes and many more dynamically update without hitting ⌘R.",
    "start": 1423323000,
    "end": 1423327500,
    "track": "Intermediate"
  },
  {
    "title":"207: Sprite Kit",
    "speaker":"Ray Wenderlich",
    "description":"Boom! In this hands-on tutorial, you’ll make your own minigame for iOS called Drop Charge, where you have to escape from an alien space ship before it explodes. In the process, you’ll learn the basics of Sprite Kit, Apple’s 2D game framework. Remember - cool guys don’t look at explosions!",
    "start": 1423331100,
    "end": 1423335600,
    "track": "Intermediate"
  },
  {
    "title":"208: Scene Kit",
    "speaker":"Kim Pedersen",
    "description":"Prerequisite: 207: Sprite Kit\n\nLights, camera, action! Have you ever wanted to make a game with 3D content but put off by the steep learning curve? This tutorial will introduce you to SceneKit: a framework for Mac and iOS 8 that allows you to create stunning 3D games with the same ease as you are accustomed to with SpriteKit - without having to learn OpenGL ES.",
    "start": 1423336500,
    "end": 1423341000,
    "track": "Intermediate"
  },



  {
    "title":"301: App Architecture",
    "speaker":"Matthijs Hollemans",
    "description":"Say no to spaghetti code! Learn how to decide which objects your app needs, how those objects should talk to each other, and how to keep your code from becoming a mess. Clean architecture makes your apps easier to write, understand, and maintain. This talk is for anyone who suspects their code could be better but doesn’t know where to start. After this talk, you’ll never look at your code the same way again.",
    "start": 1423234800,
    "end": 1423239300,
    "track": "Advanced"
  },
  {
    "title":"302: Advanced Debugging",
    "speaker":"Richard Turton",
    "description":"Nobody’s perfect. Everybody’s apps crash, or do strange and inexplicable things sometimes. In this talk you’ll learn how to track down those hard-to-find problems in your code, making clever use of breakpoints and the debugger. Learn battle-tested techniques from a developer who’s written hundreds of bugs over the years ;]",
    "start": 1423240200,
    "end": 1423244700,
    "track": "Advanced"
  },
  {
    "title":"303: Effortless Responsiveness with AsyncDisplayKit",
    "speaker":"Scott Goodson & René Cacheaux",
    "description":"AsyncDisplayKit is an iOS framework that helps make even the most complex user interfaces smooth and responsive. It was originally built for Facebook’s Paper, and goes hand in hand with Pop’s physics-based animations - but it’s just as powerful with conventional app designs. Learn how to use AsyncDisplayKit to make silky-smooth UIs - by one of the authors of the framework!",
    "start": 1423248300,
    "end": 1423252800,
    "track": "Advanced"
  },
  {
    "title":"304: Unit Testing in Practice",
    "speaker":"Ellen Shapiro",
    "description":"You’ve written a unit test or two, but are you ready to take your testing to the next level? In this session, you’ll learn advanced and practical techniques like testing in-memory stores for Core Data, async testing with XCTestExpectation, using the power of Swift for dead-easy mocking, feeding your networking stack from local files using NSURLProtocol, and more!",
    "start": 1423253700,
    "end": 1423258200,
    "track": "Advanced"
  },
  {
    "title":"305: iOS Animation: View Controller Transitions",
    "speaker":"Ryan Nystrom",
    "description":"Are you bored with push and pop navigation? Come learn how to make your app’s animations stand out by using the new UIViewController Transitioning APIs. Introduced in iOS 7, these new APIs provide an easy way to build custom animations to navigate between controllers and even make them interactive! You will leave this session knowing how to build custom transitions as well as how to wire them into existing apps.",
    "start": 1423317600,
    "end": 1423322100,
    "track": "Advanced"
  },
  {
    "title":"306: iOS Animation: Animating Auto Layout Constraints",
    "speaker":"Marin Todorov",
    "description":"Animations are fun! And you probably already know how to create some on iOS. But do you know how to create animations with Auto Layout? Do you know what it takes to move around views that are kept it their place by constraints? In this tutorial you are going to bend Auto Layout to your will and create some delightful UI animations.",
    "start": 1423323000,
    "end": 1423327500,
    "track": "Advanced"
  },
  {
    "title":"307: Core Data & Multithreading",
    "speaker":"Saul Mora",
    "description":"Is your app crashing at seemingly random times? Does your threaded Core Data code look like a plate of spaghetti? If yes, then come and learn about multithreaded Core Data, presented by the author of MagicalRecord! You’ll be amazed at the simplicity of the 3 simple rules to writing multithreaded apps with Core Data! What are these rules? Come and find out!",
    "start": 1423331100,
    "end": 1423335600,
    "track": "Advanced"
  },
  {
    "title":"308: Collection View Custom Layouts",
    "speaker":"Mic Pringle",
    "description":"Tired of the same ol’ tabular layout? Then this is the session for you! Come and learn everything you need to know about UICollectionView custom layouts, and finally take control of how your data is displayed. Introduced in iOS 6, but massively underused, the UICollectionView custom layout APIs open up a whole new world of possibilities when it comes to laying out your data.",
    "start": 1423336500,
    "end": 1423341000,
    "track": "Advanced"
  }
]